backend/app/controllers/events_controller.rb

    def set_event
      @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]