backend/app/controllers/outings_controller.rb

  def index
    @outings = Outing.all
---
SELECT "outings".* FROM "outings"