backend/app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles"
---
  def index
    @profiles = Profile.all

INSERT INTO "profiles" ("name", "email", "license", "address", "city", "state", "zipcode", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @profile = Profile.new(profile_params)

    if @profile.save